RSN/src/Catalogs/БазыДанных/БазыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БазыДанных</name>
  <owners>Catalog.СерверыБазДанных</owners>
</mdclass:Catalog>

RSN/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьНаВебСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>EnumRef.КонфигурацииИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>EnumRef.Среда</types>
    </type>
  </attributes>
  <attributes>
    <name>Контур</name>
    <type>
      <types>CatalogRef.Контур</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/БазыДанных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 
// Сопоставляет базу данных на сервере sql с информационной базой на сервере приложений 1с
//
Процедура СопоставитьБазуДанныхИИнформационнуюБазу() Экспорт
	Соединитель = Новый COMObject("V83.COMConnector"); 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерверПриложений.Ссылка КАК СерверПриложений,
	|	СерверПриложений.Наименование КАК Наименование
	|ИЗ
	|	Справочник.СерверПриложений КАК СерверПриложений
	|ГДЕ
	|	СерверПриложений.МониторингБазДанных";  
	Выборка = Запрос.Выполнить().Выбрать();  
	БазыДанных = НовыйБазыДанных();  
	ПараметрыБазыДанных = НовыйПараметрыБазыДанных(); 
	Пока Выборка.Следующий() Цикл 
		Порт = "1540"; 
		СтрокаСоединения = "TCP://" + Выборка.Наименование + ":" + Порт;
		СоединениеСАгентом = Соединитель.ConnectAgent(СтрокаСоединения);
		МассивКластеров = СоединениеСАгентом.GetClusters();
		ОписаниеКластера = МассивКластеров.GetValue(МассивКластеров.GetLowerBound());
		СоединениеСАгентом.authenticate(ОписаниеКластера, "", "");    
		Процессы = СоединениеСАгентом.GetWorkingProcesses(ОписаниеКластера); 
		ЗаполнитьПараметрыБазДанных(ПараметрыБазыДанных, 
		Процессы, БазыДанных, Выборка.СерверПриложений, Соединитель);
		ЗаполнитьДанныеБаз(ПараметрыБазыДанных);
	КонецЦикла; 
	СохранитьБазыДанных(БазыДанных);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция НовыйПараметрыБазыДанных()
	Возврат Новый Структура("Процессы, БазыДанных, СерверПриложений, Соединитель");
КонецФункции 

Процедура ЗаполнитьПараметрыБазДанных(ПараметрыБазыДанных, 
	Процессы, БазыДанных, СерверПриложений, Соединитель)
	ПараметрыБазыДанных.Процессы = Процессы;
	ПараметрыБазыДанных.БазыДанных = БазыДанных;
	ПараметрыБазыДанных.СерверПриложений = СерверПриложений;
	ПараметрыБазыДанных.Соединитель = Соединитель;
КонецПроцедуры

Процедура ЗаполнитьДанныеБаз(ПараметрыБазыДанных)
	Для каждого Процесс из ПараметрыБазыДанных.Процессы Цикл
		Попытка
			Порт = Процесс.MainPort;
			Порт = СтрЗаменить(Порт, Символы.НПП, "");
			Порт = СтрЗаменить(Порт, ",", "");
			РабПроц = ПараметрыБазыДанных.Соединитель.ConnectWorkingProcess(Процесс.HostName + ":" + Порт);
			Базы = РабПроц.GetInfoBases().Выгрузить();
			Для Каждого База из Базы Цикл  
				DBName = База.DBName;      
				DBServerName = База.DBServerName;
				Если DBName = "" Или DBServerName = "" Тогда
					Продолжить;
				КонецЕсли;
				НовСтр = ПараметрыБазыДанных.БазыДанных.Добавить(); 
				НовСтр.DBName = DBName; 
				НовСтр.DBServerName = DBServerName;
				НовСтр.Name = База.Name;
				НовСтр.СерверПриложений = ПараметрыБазыДанных.СерверПриложений;	
			КонецЦикла;  
		Исключение             
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Ошибка при сопоставление. Процесс: %1. %2",
			Процесс.Name, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Сопоставление информационных баз с базами БД", 
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки); 
		КонецПопытки;
		Прервать;
	КонецЦикла;
КонецПроцедуры 

Процедура СохранитьБазыДанных(ДанныеБаз)   
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеБаз.DBName КАК DBName,
	|	ДанныеБаз.DBServerName КАК DBServerName,
	|	ДанныеБаз.Name КАК Name,
	|	ДанныеБаз.СерверПриложений КАК СерверПриложений
	|ПОМЕСТИТЬ ДанныеБаз
	|ИЗ
	|	&ДанныеБаз КАК ДанныеБаз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнформационныеБазы.Ссылка КАК ИнформационнаяБаза,
	|	БазыДанных.Ссылка КАК БазаДанных
	|ИЗ
	|	ДанныеБаз КАК ДанныеБаз
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	|		ПО ДанныеБаз.Name = ИнформационныеБазы.Наименование
	|			И ДанныеБаз.СерверПриложений = ИнформационныеБазы.СерверПриложений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БазыДанных КАК БазыДанных
	|		ПО ДанныеБаз.DBName = БазыДанных.Наименование
	|			И (ДанныеБаз.DBServerName = БазыДанных.Владелец.Наименование
	|				ИЛИ ДанныеБаз.DBServerName = БазыДанных.Владелец.IpАдрес)
	|ГДЕ
	|	ИнформационныеБазы.Ссылка.БазаДанных <> БазыДанных.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	БазыДанных.Ссылка,
	|	ИнформационныеБазы.Ссылка";       
	Запрос.Параметры.Вставить("ДанныеБаз", ДанныеБаз);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектБазаДанных = Выборка.ИнформационнаяБаза.ПолучитьОбъект();
		ОбъектБазаДанных.ОбменДанными.Загрузка = Истина;
		ОбъектБазаДанных.БазаДанных = Выборка.БазаДанных;
		ОбъектБазаДанных.Записать();
	КонецЦикла;
КонецПроцедуры    

Функция НовыйБазыДанных()
	ДанныеБаз =	Новый ТаблицаЗначений;
	ДанныеБаз.Колонки.Добавить("DBName", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ДанныеБаз.Колонки.Добавить("DBServerName", ОбщегоНазначения.ОписаниеТипаСтрока(150));  
	ДанныеБаз.Колонки.Добавить("Name", ОбщегоНазначения.ОписаниеТипаСтрока(150));    
	ДанныеБаз.Колонки.Добавить("СерверПриложений", Новый ОписаниеТипов("СправочникСсылка.СерверПриложений"));
	Возврат ДанныеБаз;
КонецФункции 
#КонецОбласти

#КонецЕсли
